Revit 2027 API
RebarBendingDetailType.MultipleValuesIndicatorOption Property
 Identifies the option of how multiple values will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BendingDetailTypeMultipleValuesIndicatorOptions MultipleValuesIndicatorOption { get; set; }
Public Property MultipleValuesIndicatorOption As BendingDetailTypeMultipleValuesIndicatorOptions
	Get
	Set
public:
property BendingDetailTypeMultipleValuesIndicatorOptions MultipleValuesIndicatorOption {
	BendingDetailTypeMultipleValuesIndicatorOptions get ();
	void set (BendingDetailTypeMultipleValuesIndicatorOptions value);
}
member MultipleValuesIndicatorOption : BendingDetailTypeMultipleValuesIndicatorOptions with get, set
Property Value
BendingDetailTypeMultipleValuesIndicatorOptions
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace